---
kind: type
id: T:Autodesk.Revit.DB.Electrical.VoltageTypeSet
source: html/3d6a14b7-0399-2ef9-8685-cbfaaf7739cf.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet

A set that contains voltage types.

## Syntax (C#)
```csharp
public class VoltageTypeSet : APIObject,
	IEnumerable
```